/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: moeota <moeota@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/07 22:58:17 by moeota            #+#    #+#             */
/*   Updated: 2022/11/16 21:59:15 by moeota           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_tolower(int c)
{
	if (c >= 65 && c <= 90)
		c = c + 32;
	return (c);
}

// int main ()
// {
//     int c;
//     // c = toupper('a');
//     // printf("aを大文字に変換→%c\n",c);
//     c = ft_tolower('A');
//     printf("Aを小文字に変換→%c\n",c);
// }